


     Internet Draft                                       Greg Vaudreuil
     Expires in six months                           Lucent Technologies
                                                           Glenn Parsons
                                                         Nortel Networks
                                                        February 1, 1999


                  Voice Profile for Internet Mail - version 3

                           <draft-ema-vpimv3-00.txt >



  Status of this Memo

     This document is an Internet-Draft and is in full conformance with all
     provisions of Section 10 of RFC2026.

     This document is an Internet Draft.  Internet Drafts are working
     documents of the Internet Engineering Task Force (IETF), its Areas,
     and its Working Groups.  Note that other groups may also distribute
     working documents as Internet Drafts.

     Internet Drafts are valid for a maximum of six months and may be
     updated, replaced, or obsoleted by other documents at any time.  It is
     inappropriate to use Internet Drafts as reference material or to cite
     them other than as a "work in progress".

     To learn the current status of any Internet-Draft, please check the
     "1id-abstracts.txt" listing contained in the Internet-Drafts Shadow
     Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe),
     munnari.oz.au (Pacific Rim), ds.internic.net (US East Coast), or
     ftp.isi.edu (US West Coast).



  Copyright Notice

     Copyright (C) The Internet Society (1999).  All Rights Reserved.

     This Internet-Draft is in conformance with Section 10 of RFC2026.

  Overview

     This document profiles Internet mail for unified messaging.  It is a
     complement to VPIM Version 2 documented in RFC 2021.  A list of
     changes from that document are noted in Appendix F.  As well, Appendix
     A summarizes the protocol profiles of this version of VPIM.

     Please send comments on this document to the author, Greg Vaudreuil
     <gregv@lucent.com>.

     Internet Draft               VPIM V3                August 20, 1999


  Working Group Summary

     This is a working draft within being considered within the electronic
     messaging association.  It is intended that this document be presented
     to the IETF for standardization.


















































     Vaudreuil, Parsons       Expires 8/1/99                    [Page 2]
     Internet Draft               VPIM V3                August 20, 1999


  Table of Contents

  1.   ABSTRACT ..........................................................4
  2.   KEY CHANGES IN VERSION 3 ..........................................5
  3.   SCOPE .............................................................6
    3.1  Voice and Unified Messaging System Interactions .................6
    3.2  Design Goals ....................................................6
  4.   PROTOCOL RESTRICTIONS .............................................8
  5.   VOICE MESSAGE INTERCHANGE FORMAT ..................................9
    5.1  Message Addressing Formats ......................................9
    5.2  Message Header Fields ..........................................10
    5.3  MIME Content Descriptions ......................................18
    5.4  Voice Message Content Types ....................................19
    5.5  Other MIME Content Types .......................................25
    5.6  Return and Notification Messages ...............................27
    5.7  Forwarded Messages .............................................28
    5.8  Reply Messages .................................................29
    5.9  Notification Messages ..........................................30
  6.   MESSAGE TRANSPORT PROTOCOL .......................................31
    6.1  ESMTP Commands .................................................31
    6.2  ESMTP Keywords .................................................33
    6.3  ESMTP Parameters - MAIL FROM ...................................34
    6.4  ESMTP Parameters - RCPT TO .....................................35
    6.5  ESMTP - SMTP Downgrading .......................................35
  7.   CONFORMANCE REQUIREMENTS .........................................35
  8.   SECURITY CONSIDERATIONS ..........................................35
    8.1  General Directive ..............................................35
    8.2  Threats and Problems ...........................................36
    8.3  Security Techniques ............................................36
  9.   ACKNOWLEDGMENTS ..................................................39
  10.  COPYRIGHT NOTICE .................................................40
  11.  AUTHORS' ADDRESSES ...............................................40
  12.  APPENDIX A - VPIM REQUIREMENTS SUMMARY ...........................41
  13.  APPENDIX B - EXAMPLE VOICE MESSAGES ..............................42
  14.  APPENDIX C - EXAMPLE ERROR VOICE PROCESSING ERROR CODES ..........45
  15.  APPENDIX D - EXAMPLE VOICE PROCESSING DISPOSITION TYPES ..........46
  16.  APPENDIX F - CHANGE HISTORY: RFC 2421 (VPIM V2) TO THIS DOCUMENT .47


















     Vaudreuil, Parsons       Expires 8/1/99                    [Page 3]
     Internet Draft               VPIM V3                August 20, 1999


  1. Abstract

     General electronic mail (email) provides a facility for exchanging
     messages of seemingly arbitrary content.  In common email usage, text
     is the primary media with one or more attachments.

     A class of special-purpose computers has evolved to provide voice
     messaging services.  These machines generally interface to a telephone
     switch and provide call answering and voice messaging services.
     Message exchange between these voice-mail only systems can best be
     achieved using VPIM Version 2.

     Fax messaging is another special purpose messaging system which
     interface to a telephone switch and provide the ability to send and
     receive images over the PSTN.  When sending these messages over the
     Internet rather than the PSTN, the simple mode fax profile defined in
     RFC ABCD should be used.

     Other electronic messaging systems include paging, and short message
     service.  It is expected that other messaging systems developed for
     specific environments will continue to be developed.

     This profile defines a new version of the VPIM specification for the
     interchange of voice messages between a voice messaging system as
     defined in [VPIM] and a unified messaging system.  In this sense, a
     unified messaging system is capable of sending and receiving each of
     several different message types.  Typical unified messaging systems
     today consolidate fax messages, voice messages, and email messages
     into a single system and permit the forwarding a received message of
     one type as an attachment to a message of another type.

     Further, this profile will define the interactions between a media
     agnostic (multi-media) messaging system with unified messaging and
     voice messaging systems.  A media agnostic system may combine several
     media into a single message.  Such a message may not have primary a
     media but rely upon several components together to convey the
     essential information.


















     Vaudreuil, Parsons       Expires 8/1/99                    [Page 4]
     Internet Draft               VPIM V3                August 20, 1999


  2. Key changes in Version 3

     Several new capabilities are added to VPIM to form the Version 3
     specification.

       1) Three new voice encodings are profiled.  While version 2 choose
       G726 ADPCM as a compromise, experience has shown a need for a wider
       variety of encodings.  These encodings range from the larger but
       less computationally intensive Mu-Law to the high compression
       G.723.1 encoding used by Voice over IP telephony.  All VPIM Version
       3 systems must be capable of receiving audio encoded in any of
       these formats.  Sending systems may choose to send audio in any of
       the encodings.

       2) Support of the Microsoft WAV encapsulation has been added to
       provide an option to systems which need to send in a format useful
       for installed-base desktop email systems.  All VPIM Version 3
       systems must be capable of receiving audio encoded raw or in a WAV
       wrapper.  Sending systems may choose to use send raw audio data or
       encapsulate it in the WAV file format.

       3) Support the attachment of messages of any type to messages of
       any other type.  This is the common result of forwarding a message
       with cover comments from a terminal type with a primary media other
       than that of the original message.

       4) Support the inclusion of other non-primary media in a voice
       message.  In particular, permit the inclusion of textual
       information as well as the attachment of arbitrary files in the
       voice message type.

       5) Create clear discard rules such that messages with message,
       media, or attachments not recognized by the sender can be delivered
       if the primary media of the message can be deposited in the
       recipients mailbox.  Messages where the primary media cannot be
       preserved must be returned to the sender with an informative
       notification message.

       6) Define a special case of text such that messages received by a
       non-VPIM terminal will display by default advisory text describing
       the nature of the messages and providing instructions on how to
       download a suitable helper application.

       7) When it is known that the receiving system supports the same
       voice encoding as the sending system (by per-user, or per-system
       configuration), provide an option to send the audio data in the
       common audio format, even if not otherwise permitted.

      






     Vaudreuil, Parsons       Expires 8/1/99                    [Page 5]
     Internet Draft               VPIM V3                August 20, 1999


  3. Scope

     MIME is the Internet multipurpose, multimedia messaging standard.
     This document explicitly recognizes its capabilities and provides a
     mechanism for the exchange of various messaging technologies,
     primarily voice and facsimile.

     This document specifies a restricted profile of the Internet
     multimedia messaging protocols for use between voice processing server
     platforms and unified messaging platforms. This profile is intended to
     specify the minimum common set of features to allow interworking
     between compliant systems.

  3.1 Voice and Unified Messaging System Interactions

     The following are typical interactions between voice messaging and
     unified messaging systems that must be addressed by this
     specification.

     1) Text messages are not normally received and often cannot be easily
       displayed or viewed on voice mail machines.  They can sometimes be
       processed via text-to-speech or text-to-fax features.

     2) Unified messaging systems accept addresses in several formats
       relative to the type of message.  In particular, Internet
       addressing uses the domain name system while fax and voice
       messaging use the telephone numbering system.  Addressing must be
       adapted or re-formatted such that a messages from one domain
       preserves the ability to reply to all recipients.

     3) Voice messaging systems are not capable of rendering all message
       types and are not capable of rendering all media types.  A
       combination of capabilities exchange and clear downgrade rules are
       necessary to provide a seamless interaction between more capable
       and less capable systems.

     4) Error reports must be machine-parseable so that helpful responses
       can be presented to users in a manner appropriate to the terminal
       where they receive the message at.

  3.2 Design Goals

     It is a goal of this profile to make as few restrictions and additions
     to the existing Internet mail protocols as possible while satisfying
     the requirements for interoperability between voice mail system,
     unified messaging systems, and general Internet email. It is also a
     goal to make the necessary extensions as backward compatible with VPIM
     Version 2 as possible.  Where this is not possible, it may be
     desirable to clarify or revise Version 2 to make it so.






     Vaudreuil, Parsons       Expires 8/1/99                    [Page 6]
     Internet Draft               VPIM V3                August 20, 1999


     This profile is intended to be robust enough to be used in an
     environment, such as the global Internet with installed-base gateways
     which do not understand MIME, though typical use is expected to be
     within corporate intranets.  Full functionality, such as reliable
     error messages and binary transport, will require careful selection of
     gateways (e.g., via MX records) to be used as VPIM forwarding agents.
     Nothing in this document precludes use of general purpose MIME email
     packages to read and compose VPIM messages.  While no special
     configuration is required to receive VPIM compliant messages, some may
     be required to originate compliant structures.













































     Vaudreuil, Parsons       Expires 8/1/99                    [Page 7]
     Internet Draft               VPIM V3                August 20, 1999


  4. Protocol Restrictions

     <To be added>

     The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
     "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in this
     document are to be interpreted as described in [REQ].
















































     Vaudreuil, Parsons       Expires 8/1/99                    [Page 8]
     Internet Draft               VPIM V3                August 20, 1999


  5. Voice Message Interchange Format

     The voice message interchange format is a profile of the Internet Mail
     Protocol Suite.  Any Internet Mail message containing the format
     defined in this section is referred to as a VPIM Version 3 Message in
     this document.  As a result, this document assumes an understanding of
     the Internet Mail specifications.  Specifically, VPIM references
     components from the message format standard for Internet messages
     [RFC822], the Multipurpose Internet Message Extensions [MIME], the
     X.400 gateway specification [X.400], delivery status and message
     disposition notifications [REPORT][DSN][DRPT][STATUS][MDN], and the
     electronic business card [MIMEDIR][VCARD].

  5.1 Message Addressing Formats

     [RFC822] addresses are based on the domain name system.  This naming
     system has two components: the local part, used for username or
     mailbox identification; and the host part, used for global machine
     identification.

  5.1.1 Server-to-Server VPIM Addresses

     VPIM Version 3 places no restrictions on the "from:" of the Internet
     address. VPIM Version 3 (and v2) systems must be capable of receiving
     an arbitrary email address and generating a reply to that address.  No
     inferences about the structure of the local part (left hand side)
     should be necessary.

     Recipients email addresses must be created in a form compatible with
     the recipients system and consistent with the address entry
     capabilities of a telephone user interface.

  5.1.2 Special Addresses

     Special addresses are provided for compatibility with the conventions
     of Internet mail.  These addresses do not use numeric local addresses,
     both to conform to current Internet practice and to avoid conflict
     with existing numeric addressing plans. Two special addresses are
     RESERVED for use as follows:

     postmaster@domain

     By convention, a special mailbox named "postmaster" MUST exist on all
     systems.  This address is used for diagnostics and should be checked
     regularly by the system manager. This mailbox is particularly likely
     to receive text messages, which is not normal on a voice processing
     platform.  The specific handling of these messages is an individual
     implementation choice.

     non-mail-user@domain





     Vaudreuil, Parsons       Expires 8/1/99                    [Page 9]
     Internet Draft               VPIM V3                August 20, 1999


     If a reply to a message is not possible, such as a telephone answering
     message or a fax message, then the special address "non-mail-user"
     must be used as the originator's address.  Any text name such as
     "Telephone Answering", or the telephone number if it is available, is
     permitted.  This special address is used as a token to indicate an
     unreachable originator. For compatibility with the installed base of
     mail user agents, implementations that generate this special address
     MUST send a negative delivery status notification (DSN) for reply
     messages sent to the undeliverable address.  The status code for such
     NDN's is 5.1.1 "Mailbox does not exist".

     Examples:

                 From: Telephone Answering <non-mail-user@mycompany.com>
                 From: 9727332722 <non-mail-user@mycompany.com>

  5.1.3 Distribution Lists

     There are many ways to handle distribution list (DL) expansions and
     none are 'standard'.  Simple alias is a behavior closest to what most
     voice mail systems do today and what is to be used with VPIM messages.
     That is:

       Reply to the originator - (Address in the RFC822 "Reply-to:" or
                                  "From":" field)
       Errors to the submitter - (Address in the "MAIL FROM:" field of the
                                  ESMTP exchange and the Return-Path:
                                  RFC 822 field)

     Some proprietary voice messaging protocols include only the recipient
     of the particular copy in the envelope and include no "header fields"
     except date and per-message features.  Most voice messaging systems do
     not provide for "Header Information" in their messaging queues and
     only include delivery information.  As a result, recipient information
     MAY be in either the To or CC header fields. If all recipients cannot
     be presented (e.g. unknown DL expansion) then the recipient header
     fields MUST be omitted to indicate that an accurate list of recipients
     (e.g. for use with a reply-all capability) is not known.

     Note: Discuss use of the group notation of [RFC822] as a placeholder
     for unknown recipients.

  5.2 Message Header Fields

     Internet messages contain a header information block.  This header
     block contains information required to identify the sender, the list
     of recipients, the message send time, and other information intended
     for user presentation.  Except for specialized gateway and mailing
     list cases, header fields do not indicate delivery options for the
     transport of messages.

     Distribution list processors are noted for modifying or adding to the
     header fields of messages that pass through them.  VPIM systems MUST
     be able to accept and ignore header fields that are not defined here.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 10]
     Internet Draft               VPIM V3                August 20, 1999


     The following header lines are permitted for use with VPIM voice
     messages:

  5.2.1 From

     The originator's fully-qualified domain address (a mailbox address
     followed by the fully-qualified domain name). The user listed in this
     field "SHOULD" be presented in the voice message envelope as the
     originator of the message.

     SEND RULES

     Systems compliant with this profile SHOULD provide the text personal
     name of the voice message originator in a quoted phrase, if the name
     is available.  Text names of corporate or positional mailboxes MAY be
     provided as a simple string. From [RFC822]

     Example:

                 From: "Joe S. User" <12145551212@mycompany.com>

                 From: Technical Support <611@serviceprovider.com>

                 From: Non-mail-user@myserver.mycompany.com

     Voice mail machines may not be able to support separate attributes for
     the "From:" and "Reply-To:" header fields and the vCard email
     attribute, VPIM-conforming systems SHOULD set these values to the same
     address.  Use of addresses different than those present in the "From:"
     header field address may result in unanticipated reply behavior.

     RECEPTION RULES

     The "From:" address SHOULD be used for replies (see 5.7.1).  However,
     if the "From:" address contains <non-mail-user@domain>, the user
     SHOULD NOT be offered the option to reply, nor should notifications be
     sent to this address.

  5.2.2 To

     The "To:" field contains the recipient's fully-qualified domain
     address.  There MAY be one or more "To:" fields in any message.

     Examples:

                 To: +12145551213@mycompany.com

                 To: Undisclosed Recipient:;

     SEND RULES

     Systems SHOULD provide a list of recipients only if all recipients are
     provided.


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 11]
     Internet Draft               VPIM V3                August 20, 1999


     Systems such as gateways from protocols which do not indicate the
     complete list of recipients SHOULD provide a "To:" line.  Because
     these systems cannot accurately enumerate all recipients in the "To:"
     headers, no recipients should be enumerated.  The group notation of
     RFC822 MAY be used in this case.

     (see 5.1.3).

     RECEPTION RULES

     Systems compliant to this profile MAY discard the addresses in the
     "To:" fields if they are unable to store the information. This would,
     of course, make a reply-to-all capability impossible.  If present, the
     addresses in the "To:" field MAY be used for a reply message to all
     recipients.

  5.2.3 Cc

     The "Cc:" field contains additional recipients' fully-qualified domain
     addresses. Many voice mail systems maintain only sufficient envelope
     information for message delivery and are not capable of storing or
     providing a complete list of recipients.

     SEND RULES

     Conforming implementations SHOULD send "Cc:" lists if all recipients
     that should be disclosed can be disclosed. The list of disclosed
     recipients does not include those sent via a blind copy. If not,
     systems SHOULD omit the "Cc:" fields or use the group notation from
     RFC822 to indicate that the full list of recipients is unknown or
     otherwise unavailable.

     Example:

                 Cc: +12145551213@mycompany.com

     RECEIVE RULES

     Systems compliant to this profile MAY discard the addresses in the
     "Cc:" fields of incoming messages as necessary.    If a list of "Cc:"
     addresses is present, these addresses MAY be used for a reply message
     to all recipients.

  5.2.4 Date

     The "Date:" field contains the date, time, and time zone in which the
     message was sent by the originator.

     SEND RULES






     Vaudreuil, Parsons       Expires 8/1/99                   [Page 12]
     Internet Draft               VPIM V3                August 20, 1999


     The time zone SHOULD be represented in a four-digit time zone offset,
     such as -0500 for North American Eastern Standard Time.  This MAY be
     supplemented by a time zone name in parentheses, e.g., "-0900 (PDT)".
     Compliant implementations SHOULD be able to convert [RFC822] date and
     time stamps into local time.

     If the VPIM sender is relaying a message from a system which does not
     provide a time stamp, the time of arrival at the gateway system SHOULD
     be used as the date.

     Example:

                 Date: Wed, 28 Jul 96 10:08:49 -0800 (PST)

     RECEIVE RULES

     The sending system MUST report the time the message was sent. From
     [RFC822]

  5.2.5 Sender

     SEND RULES

     The "Sender:" field contains the actual address of the originator if
     the message is sent by an agent on behalf of the author indicated in
     the "From:" field. This header field MAY be sent by VPIM-conforming
     systems.  I

     RECEPTION RULES

     If the address in the "Sender:" field cannot be preserved in the
     recipient's message queues or in the next-hop protocol from a gateway,
     the field MAY be silently discarded.

  5.2.6 Return-Path

     The "Return-path:" field is added by the final delivering SMTP server.
     If present, it contains the address from the MAIL FROM parameter of
     the ESMTP exchange (see 6.1.2). Any error messages resulting from the
     delivery failure MUST be sent to this address.  Note that if the
     "Return-path:" is null ("<>"), e.g. no path, loop prevention or
     confidential, delivery status and message disposition notifications
     MUST NOT be sent.

      RECEPTION RULES










     Vaudreuil, Parsons       Expires 8/1/99                   [Page 13]
     Internet Draft               VPIM V3                August 20, 1999


     The "Return-path:" field contains special purpose trace information
     useful in some implementations where final delivery ocures after the
     acceptance of the message by SMTP.  A system which provides final
     delivery and cannot store the return-path is dangerously broken.  If
     the receiving system is incapable of storing the return path to be
     used for subsequent delivery errors, the receiving system must
     otherwise ensure that further delivery errors don't happen. Systems
     that do not support the return path MUST ensure that at the time the
     message is acknowledged, the message is delivered to the recipient's
     ultimate mailbox.  Non-Delivery notifications should not be sent after
     that final delivery.

     Systems should go to heroic extremes to protect the return path in a
     store-and-forward multiprotocol gateway.

  5.2.7 Message-id

     The "Message-Id:" field contains a unique per-message identifier.  A
     unique message-id MUST be generated for each message sent from a VPIM-
     compliant implementation.

     Example:

                 Message-Id: <12345678@mycompany.com>

     The message Id is not required to be stored on the receiving system.
     This identifier MAY be used for tracking, auditing, and returning
     receipt notification reports.  From [RFC822]

  5.2.8 Reply-To

     If present, the "Reply-to:" header provides a preferred address to
     which reply messages should be sent (see 5.7.1).  Typically, voice
     mail systems can only support one originator of a message so it is
     likely that this field will be ignored by the receiving system.
     Further, the exact semantic meaning of this header is subject to
     substantial debate and is considered unclear at this time. From
     [RFC822]

     SEND RULES

     A compliant system SHOULD NOT send a Reply-To header.

     RECEPTION RULES

     If a "reply-to:" field is present, a reply-to sender message MAY be
     sent to the address specified (that is, in lieu of the address in the
     "From:" field). If only one address of the originator is supported in
     the message store or in the next-hop protocol from a multi-protocol
     gateway, the address in the "From:" field MUST be used and the "Reply-
     To:" field MAY be silently discarded.




     Vaudreuil, Parsons       Expires 8/1/99                   [Page 14]
     Internet Draft               VPIM V3                August 20, 1999


  5.2.9 Received

     The "Received:" field contains trace information added to the
     beginning of a RFC 822 message by MTAs.  This is the only field
     permitted to be added by an MTA.  Information in this header is useful
     for debugging when using an US-ASCII message reader or a header-
     parsing tool. From [RFC822]

     SEND RULES

     A VPIM-compliant system MUST add a "Received:" fields when acting as a
     gateway.

     RECEPTION RULES

     A VPIM-compliant system SHOULD NOT remove any "Received:" fields when
     relaying messages to other MTAs or gateways.  These header fields MAY
     be ignored or deleted when the message is received at the final
     destination.

  5.2.10 MIME Version

     The "MIME-Version:" field indicates that the message conforms to
     [MIME]. Systems compliant with this specification SHOULD include a
     comment with the words "(Voice 3.0)". [VPIM1] defines an earlier
     version of this profile and uses the token (Voice 1.0). RFC [VPIM2]
     defines an earlier version of this profile and uses the token (Voice
     2.0)

     Example:

                 MIME-Version: 1.0 (Voice Version 3)

     This identifier is intended for information only and SHOULD NOT be
     used to semantically identify the message as being a VPIM message.
     Instead, the presence of the content defined in [V-MSG] SHOULD be used
     if identification is necessary.

  5.2.11 Sensitivity

     The "Sensitivity:" field, if present, indicates the requested privacy
     level.  The case-insensitive values "Personal", "Private", and
     "Normal" are specified. If no privacy is requested, this field is
     omitted.

     SEND RULES

     A VPIM-compliant implementations MAY include this header to indicate
     the sensitivity of a message. If the message is of "Normal"
     sensitivity, this field MAY be omitted. From: [X.400]

     RECEPTION RULES



     Vaudreuil, Parsons       Expires 8/1/99                   [Page 15]
     Internet Draft               VPIM V3                August 20, 1999


     If a "Sensitivity:" field with a value of "Personal" or "Private" is
     present in the message, a compliant system SHOULD prohibit the
     recipient from forwarding this message to any other user.  A compliant
     system, however, SHOULD allow the responder to reply to a sensitive
     message, but SHOULD NOT include the original message content.  The
     sensitivity of the reply message MAY be set by the responder.

     **** The following requirement from VPIM needs to be evaluated in
     light of general Internet email client behaviors ******

     If the receiving system does not support privacy and the sensitivity
     is one of "Personal" or "Private", a negative delivery status
     notification MUST sent to the originator with the appropriate status
     code (X.Y.Z) indicating that privacy could not be assured. The message
     contents SHOULD be returned to the sender to allow for a voice context
     with the notification. A non-delivery notification to a private
     message SHOULD NOT be tagged private since it will be sent to the
     originator.  From: [X.400]

     (Is is worth differentiating between private and personal for the
     purposes of sending the NDN?)

  5.2.12 Importance

     Indicates the requested importance to be given by the receiving
     system.  The case-insensitive values "low", "normal" and "high" are
     specified.  If no special importance is requested, this header may be
     omitted and the value of the absent header assumed to be "normal".
     From: [X.400]

     SEND RULES

     Compliant implementations MAY include this header to indicate the
     importance of a message

     RECEPTION RULES

     If the receiving system does not support importance, the attribute may
     be silently dropped.  If the attribute is supported, it can be used
     for various user interface purposes including the ordering messages
     within a mailbox or trigging notification devices such as pagers.

  5.2.13 Subject

     The subject field is often provided by email systems but is not widely
     supported on Voice Mail platforms. From [RFC822]

     SEND RULES







     Vaudreuil, Parsons       Expires 8/1/99                   [Page 16]
     Internet Draft               VPIM V3                August 20, 1999


     For compatibility with text based mailbox interfaces, a text subject
     field SHOULD be generated by a compliant implementation. It is
     recommended that voice-messaging systems that do not support any text
     user interfaces (e.g. access only by a telephone) insert a generic
     subject header of "Voice Message" for the benefit of GUI enabled
     recipients.

     RECEPTION RULES

     It is anticipated that many voice-only systems will be incapable of
     storing the subject line. The subject MAY be discarded if present by a
     receiving system.

  5.2.14 Disposition-Notification-To

     This header MAY be present to indicate that the sender is requesting a
     receipt notification from the receiving user agent.  This message
     disposition notification (MDN) is typically sent by the user agent
     after the user has listened to the message and consented to an MDN
     being sent

     Example:

                 Disposition-notification-to: +12145551213@mycompany.com

     SEND RULES

     VPIM-compliant implementations MAY include this header to request a
     disposition indication such as a listen confirmation.

     RECEPTION RULES

     The presence of a "Disposition-notification-to:" header in a message
     is merely a request for an MDN described in 5.6.3.  The recipients'
     system is always free to silently ignore such a request so this header
     does not burden any system that does not support it.  From [MDN].

  5.2.15 Disposition-Notification-Options

     This header MAY be present to define future extensions parameters for
     an MDN requested by the presence of the header in the previous
     section.

     SEND RULES

     No "Disposition-notification-options:" are defined that are useful for
     voice messaging.  Sending systems MUST NOT request disposition
     notification options by sending a disposition-notification-options
     header.

     RECEPTION RULES

     Currently no parameters are defined by this document or by [MDN].
     However for forward compatibility with future extensions,, this header

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 17]
     Internet Draft               VPIM V3                August 20, 1999


     MUST be processed if present, if MDNs are supported.  If it contains a
     extension parameter that is required for proper MDN generation (noted
     with "=required"), then an MDN MUST NOT be sent if the parameter is
     not understood.  See [MDN] for complete details.

     Example:

                 Disposition-notification-options:
                    whizzbang=required,foo

  5.3 MIME Content Descriptions

  5.3.1 Content-Description:

       This field MAY be present to facilitate the text identification of
       these body parts in simple email readers.  Any values may be used,
       though it may be useful to use values similar to those for Content-
       Disposition.

       Example:

                 Content-Description: Big Telco Voice Message

  5.3.2 Content-Disposition:

       This field MUST be present to allow the parsable identification of
       these body parts.  This is especially useful if, as is typical,
       more than one Audio/* body occurs within a single level (e.g.
       multipart/voice-message).  Since a VPIM voice message is intended
       to be automatically played upon display of the message, in the
       order in which the audio contents occur, the audio contents must
       always be of type inline.  However, it is still useful to include a
       filename value, so this should be present if this information is
       available.  From [DISP]

       In order to distinguish between the various types of audio contents
       in a VPIM voice message a new disposition parameter "voice" is
       defined with the parameter values below to be used as appropriate
       (see Error! Reference source not found.):

          Voice-Message - the primary voice message,
          Voice-Message-Notification - a spoken delivery notification
            or spoken disposition notification,
          Originator-Spoken-Name - the spoken name of the originator,
          Recipient-Spoken-Name - the spoken name of the recipient if
            available to the originator and present if there is ONLY one
            recipient,
          Spoken-Subject- the spoken subject of the message, typically
            spoken by the originator

       Note that there SHOULD only be one instance of each of these types
       of audio contents per message level.  Additional instances of a
       given type (i.e., parameter value) may occur within an attached
       forwarded voice message.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 18]
     Internet Draft               VPIM V3                August 20, 1999


       Implementations that do not understand the "voice" parameter (or
       the Content-Disposition header) can safely ignore it, and will
       present the audio bodyparts in order (but will not be able to
       distinguish between them).

  5.3.3 Content-Duration:

       This field MAY be present to allow the specification of the length
       of the audio bodypart in seconds.  The use of this field on
       reception is a local implementation issue.  From [DUR]

       Example:

                 Content-Duration: 33

  5.3.4 Content-Language:

       This field MAY be present to allow the specification of the spoken
       language of the audio bodypart.  The encoding is defined in [LANG].
       The use of this field on reception is a local implementation issue.

       Example for UK English:

                 Content-Language: en-UK

  5.4 Voice Message Content Types

     MIME, introduced in [MIME1], is a general-purpose message body format
     that is extensible to carry a wide range of body parts.  It provides
     for encoding binary data so that it can be transported over the 7-bit
     text-oriented SMTP protocol.  This transport encoding (denoted by the
     Content-Transfer-Encoding header field) is in addition to the audio
     encoding required to generate a binary object.

     MIME defines two transport encoding mechanisms to transform binary
     data into a 7 bit representation, one designed for text-like data
     ("Quoted-Printable"), and one for arbitrary binary data ("Base64").
     While Base64 is dramatically more efficient for audio data, either
     will work.  Where binary transport is available, no transport encoding
     is needed, and the data can be labeled as "Binary".

     An implementation in compliance with this profile SHOULD send audio
     and/or facsimile data in binary form when binary message transport is
     available.  When binary transport is not available, implementations
     MUST encode the audio and/or facsimile data as Base64.  The detection
     and decoding of "Quoted-Printable", "7bit", and "8bit" MUST be
     supported in order to meet MIME requirements and to preserve
     interoperability with the fullest range of possible devices.  However,
     if a content is received in a transfer encoding that cannot be
     rendered to the user, an appropriate negative delivery status
     notification MUST be sent.




     Vaudreuil, Parsons       Expires 8/1/99                   [Page 19]
     Internet Draft               VPIM V3                August 20, 1999


     The content types described in this section are identified for use
     within the multipart/voice-message; version = Version 3 content.  This
     content, which is the fundamental part of a VPIM Version 3 message, is
     referred to as a VPIM voice message in this document.

     Contents in the multipart/voice message which are not primary may be
     discarded as necessary to accomplish delivery.  A system which needs
     to drop content to achieve delivery MUST provide notification to the
     recipient indicating that content was dropped is required.

  5.4.1 Multipart/Voice-Message

     This MIME multipart structure provides a mechanism for packaging a
     voice message into one container that is tagged as VPIM Version 3
     compliant.  The semantic of multipart/Voice-Message (defined in [V-
     MSG]) is identical to multipart/mixed and may be interpreted as that
     by systems that do not recognize this content-type.

     The Multipart/Voice-Message content-type MUST only contain the
     profiled media and content types specified in this section (i.e.
     audio/*, image/*, message/rfc822 and text/directory).  The most common
     will be: spoken name, spoken subject, the message itself, attached fax
     and directory info.  Forwarded messages are created by simply using
     the message/rfc822 construct.

     Conformant implementations MUST send voice messages with the
     multipart/voice-message as the top level (i.e. in the Content-Type
     header).  Conformant implementations MUST recognize the
     Multipart/Voice-Message content (whether it is a top level content or
     below a multipart/mixed) and be able to separate the contents (e.g.
     spoken name or spoken subject).

  5.4.2 Message/RFC822

     MIME requires support of the Message/RFC822 message encapsulation body
     part.  This body part is used within a multipart/voice-message to
     forward complete messages (see 5.7) or to reply with original content
     (see 5.7.1). From [MIME2]

     RECEPTION RULES

     May flatten structure if necessary.  If flattening, must discard other
     vCards of forwarded parts such that only the outermost vCard is
     retained.

  5.4.3 Text/Directory



            This section needs to be adjusted to meet the needs of the
            helper-application based clients.  The vCard must contain all
            informaiton necessary to construct a valid reply-to-sender
            message.  This should be possible by tighning the rules a bit.


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 20]
     Internet Draft               VPIM V3                August 20, 1999


     This content allows for the inclusion of a Versit vCard [VCARD]
     electronic business card within a VPIM message.  The format is
     suitable as an interchange format between applications or systems, and
     is defined independent of the method used to transport it.  It
     provides a useful mechanism to transport information about the
     originator that can be used by the receiving VPIM system  or other
     local applications

     Each vCard MUST be contained within a Text/Directory content type
     [MIMEDIR] within a VPIM message.  [MIMEDIR] requires that the
     character set MUST be defined as a parameter value (typically us-ascii
     for VPIM) and that the profile SHOULD be defined (the value MUST be
     vCard within VPIM messages).

     Each VPIM message SHOULD be created with a Text/Directory (vCard
     profile) content type that MUST contain the preferred email address,
     telephone number, and text name of the message originator as well as
     the vCard version.  The vCard SHOULD contain the spoken name and role
     of the originator, as well as the revision date.  Any other vCard
     attribute MAY also be present.  The intent is that the vCard be used
     as the source of information to contact the originator (e.g., reply,
     call).  The vCard profile [VCARD] MUST specify at least the following
     attributes:

       TEL  -    Public switched telephone number in international (E.164)
                 format (various types, typically VOICE)

       EMAIL -   email address (various types, typically INTERNET; the
                 type VPIM is optionally used to denote an address that
                 supports VPIM messages.  This address will be used for
                 reply-to-sender functionality when the RFC822 header
                 fields are not acessable to the voice mail helper
                 application.

       Version - Indicates the version of the vCard profile.  Version 3.0
                 [VCARD] MUST be used.

     The following attributes SHOULD be specified:

       N   -   Family Name, Given Name, Additional Names, Honorific
               Prefixes, and Suffixes. Because it is expected that
               recipients using a telephone user interface will use the
               information in the vCard to identify the originator, and
               the GUI will see the information presented in the FROM
               line, all present components in the text name of the FROM
               header field MUST match the values provided by the Vcard.

       SOUND - spoken name sound data (various types, typically 32KADPCM)

       REV  -  Revision of vCard in ISO 8601 date format

       The following attributes MAY be specified:



     Vaudreuil, Parsons       Expires 8/1/99                   [Page 21]
     Internet Draft               VPIM V3                August 20, 1999


     The vCard MAY use other attributes as defined in [VCARD] or extensions
     attributes not yet defined (e.g. recipient media capabilities).

     If present, the spoken name attribute must be included inline in the
     vCard.  This is a change from VPIM V2 to facilitate easier processing
     by desktop clients that launch vCard viewers via helper application
     launched with only the contents of a single mime body part.

     Each multipart/voice-message content MUST only contain one vCard --
     more than one is an error condition.  A VPIM message may contain
     forwarded messages.  VCards that are part of the forwarded messages
     are permitted. However, these vCards MUST be associated with the
     originator(s) of the forwarded message(s) and the originator of the
     forwarding message.  As a result, all forwarded vCards will be
     contained in message/rfc822 contents -- only the vCard of forwarding
     originator will be at the top-level.

     Example:


       Content-Type: text/directory; charset=us-ascii; profile=vCard
       Content-Transfer-Encoding: 7bit

       BEGIN:VCARD
       N:Parsons;Glenn
       ORG:Northern Telecom
       TEL;TYPE=VOICE;MSG;WORK:+1-613-763-7582
       EMAIL;TYPE=INTERNET;glenn.parsons@nortel.ca
       EMAIL;TYPE=INTERNET;VPIM:6137637582@vm.nortel.ca
       SOUND;TYPE=32KADPCM;ENCODING=B;
         Base-64 encoded spoken name data
       REV:19960831T103310Z
       Version: 3.0
       END:VCARD


  5.4.4 Required Audio Formats

     SEND RULES

     VPIM Version 3 implementations MAY send audio in any of the profiled
     voice encodings.  Implementations MAY send the audio in either native
     MIME packaging or encapsulated within the Microsoft WAV packaging.

     RECEIVE RULES

     VPIM Version 3 implementations MUST be capable of receiving each of
     the below profiled voice encodings.  Implementations MUST accept audio
     in either the native MIME packaging or encapsulated within the
     Microsoft WAV packaging.

     If an implementation can only store or forward one voice segment, then
     multiple voice segments in a single message (if present) SHOULD be


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 22]
     Internet Draft               VPIM V3                August 20, 1999


     concatenated, and SHOULD NOT be discarded.  It is RECOMMENDED that the
     segments be concatenated in the same order as they were received.

  5.4.4.1 Audio/Basic

     An implementation compliant to this profile MAY send and MUST receive
     Audio/BASIC [MIME?].  This encoding is the most widely supported voice
     encoding in computer telephony and on the WEB.  It requires the
     minimum computation to create and is available on virtually all sound-
     equipped computers.  It is also the least compressed of the formats
     with a data rate of 64 kbits/second. It is therefore an ideal encoding
     for lightweight, well-connected message sending clients.

  5.4.4.2 Audio/32KADPCM

     An implementation compliant to this profile MAY send and MUST receive
     Audio/32KADPCM [ADPCM].  This encoding is the required default for
     VPIM V2 systems.  This encoding is a moderately compressed encoding
     with a data rate of 32 kbits/second using moderate processing
     resources.  Because the encoding has been in widespread use for over
     20 years, there is believed to be no outstanding intellectual property
     claims.

  5.4.4.3 Audio/MS-GSM

     An implementation compliant to this profile MAY send and MUST receive
     Audio/MS-GSM [MSGSM].  This is a widely supported voice encoding in
     the installed base of Microsoft Windows(TM) desktops.  It provides
     substantial compression at 13 kbits/second with substantial
     processing.

  5.4.4.4 Audio/G723.1

     **** Recent discussions suggest this encoding should be dropped.
     These discussions indicate the IPR issues are substantial and the
     benefits over GSM are not sufficient to justify must receive status
     ****

     An implementation compliant to this profile MAY send and MUST receive
     Audio/G.723.1.  This is a state-of-the-art voice encoding with high
     compression at 6.8 kbits/second.  This low bitrate provides better-
     than-real-time download to clients connected over contemporary dial-up
     Internet connections.  This encoding requires substantial computing
     resources to encode.  The compression is encumbered by substantial
     intellectual property claims that need to be considered.

  5.4.4.5 Audio/wav

     The Audio/wav is not an audio encoding per-se.  It is a packaging of
     an audio encoding into a Microsoft desktop-friendly wrapper. This
     wrapping offers the benefit of being widely understood by helper
     applications resident within a Microsoft Windows environment.  When
     the WAV packaging is used in conjunction with the mu-Law or GSM


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 23]
     Internet Draft               VPIM V3                August 20, 1999


     encoding, messages received by a non-VPIM aware client may be
     minimally rendered.

     While interpreting a WAV package offers little cost, the generation of
     a WAV file may be difficult in many architectures.  The WAV format is
     difficult to create in a streaming environment because an accurate
     length must be known and recorded at the beginning of the data stream.
     For these reasons, VPIM Version 3 implementations MUST accept the WAV
     packaging and MAY send the following codecs in the WAV packaging.

     To promote maximum interoperability with desktop email clients and
     audio helper applications, conforming systems MUST send only a single
     audio segment per WAV file.  To enable attachment-oriented desktop
     clients to launch an audio helper application, conforming systems must
     include a content-disposition header with a filename containing a
     ".wav" suffix.

     For convenience, the WAV codec numbers for the four required codecs
     are listed below.

     +---------+----------------+-------------------+
     |Codec    |  WAV Number    | MIME Registration |
     +---------+----------------+-------------------+
     |G.726    |  0x0064 (100)  | Audio/32kadpcm    |
     +---------+----------------+-------------------+
     |G.711    |  0x0007 (7)    | Audio/Basic       |
     +---------+----------------+-------------------+
     |GSM 6.10 |  0x0031 (49)   | Audio/MS-GSM      |
     +---------+----------------+-------------------+
     |G723.1   |  0x0042 (66)   | Audio/G723-1      |
     +---------+----------------+-------------------+

  5.4.4.6 Audio/X-wav

     Applications wishing to send messages encoded in the WAV file format
     SHOULD use the audio/wav.  Conforming implementations should not send
     Audio/X-wav

     RECEPTION RULES

     For backward compatibility with the installed base of wav file sending
     systems, receiving implementation MUST treat the audio/X-wav content
     the same as Audio/wav.

  5.4.5 Proprietary Voice Formats

     Use of any other encoding except the required codecs reduces
     interoperability in the absence of explicit knowledge about the
     capabilities of the recipient. A compliant implementation MAY use any
     other encoding provided a unique identifier is registered with the
     IANA prior to use (see [MIME4]).  The voice encodings should be
     registered as sub-types of Audio.

     SEND RULES

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 24]
     Internet Draft               VPIM V3                August 20, 1999


     Proprietary voice encoding formats or other standard formats MAY be
     sent under this profile provided the sender has a reasonable
     expectation that the recipient will accept the encoding.  In practice,
     this requires explicit per-destination configuration information
     maintained either in a directory, personal address book, or gateway
     configuration tables.

     RECEIVE RULES

     Under the VPIM Version 3 profile, audio contents are considered the
     primary information carrying contents of the message.  Systems which
     receive audio/* content types which they are unable to decode MUST
     return the message to the originator with an NDN indicating media not
     supported.

  5.5 Other MIME Content Types

     **** Clear up discard rules ****

     Only the above specified contents are required to be supported within
     a multipart/voice message by a receiving system.  Other contents may
     be included within the multipart/voice-message if the sender has a
     reasonable expectation the recipient can receive the message.

     An implementation compliant with this profile MAY send additional
     contents in a VPIM message.  If an implementation receives a VPIM
     message  that contains content types not specified in this profile,
     their handling is a local implementation issue (e.g. the unknown
     contents MAY be discarded if they cannot be presented to the
     recipient).  Conversely, if an implementation receives a non-VPIM
     message (i.e., without a multipart/voice-message content type) with
     any of the contents defined in 5.4 & 5.5, it SHOULD deliver those
     contents, but the full message handling is a local issue (e.g. the
     unknown contents _or_ the entire message MAY be discarded).
     Implementations MUST issue negative delivery status notifications to
     the originator when any form of non-delivery to the recipient occurs.

     The multipart contents defined below MAY be sent within a
     multipart/voice message (with other noted contents below them as
     required.)  When multiple contents are present, they SHOULD be
     presented to the user in the order that they appear in the message.
     Several examples are given in Appendix B.

  5.5.1 Image/Tiff

     A common image encoding for facsimile, known as TIFF-F, is a
     derivative of the Tag Image File Format (TIFF) and is described in
     several documents.  For the purposes of VPIM, the F Profile of TIFF
     for Facsimile (TIFF-F) is defined in [TIFF-F] and the image/tiff MIME
     content type is defined in [TIFFREG].  While there are several formats
     of TIFF, only TIFF-F is profiled for use within a VPIM voice message.
     Further, since the TIFF-F file format is used in a store-and-forward
     mode with VPIM, the image MUST be encoded so that there is only one
     image strip per facsimile page.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 25]
     Internet Draft               VPIM V3                August 20, 1999


     SEND RULES

     All VPIM implementations that support facsimile SHOULD generate TIFF-F
     compatible facsimile contents in the image/tiff; application=faxbw
     sub-type encoding by default.  An implementation MAY send this fax
     content in VPIM voice messages and MUST be able to recognize and
     display it in received messages.  If a fax message is received that
     cannot be rendered to the user (e.g. the receiving VPIM system does
     not support fax), then the system MUST return the message with a
     negative delivery status notification with a media not supported
     status code.

     While any valid MIME body header MAY be used (e.g., Content-
     Disposition to indicate the filename), none are specified to have
     special semantics for VPIM and MAY be ignored.  Note that the content
     type parameter application=faxbw MUST be included in outbound
     messages.  However, inbound messages with or without this parameter
     MUST be rendered to the user (if the rendering software encounters an
     error in the file format, some form of negative delivery status
     notification MUST be sent to the originator).

     RECEIVE RULES

     As with any non-voice attachment, a receiving system may accept a
     voice message and discard the fax content.  The recipient SHOULD be
     notified of the dropped content.  The sender of a message MAY be
     notified of a partial message delivery by issuing a suitable MDN.
     (details needed)

  5.5.2 Multipart/Mixed

     SEND RULES

     Multipart/voice message provides the facilities for enclosing several
     body parts in a single message. The semantics of using complex
     hierarchy within a voice message is undefined and the use of such a
     structure is discouraged.

     RECEIVE RULES

     Compliant systems MUST accept multipart/mixed body parts within a
     multipart/voice messages.  Systems may collapse the contents of the
     multipart/mixed structure into the multipart/voice message itself.
     From [MIME2]

  5.5.3 Text/Plain

     MIME requires support of the basic Text/Plain content type.  This
     content type has limited applicability within the voice messaging
     environment.  However, because VPIM is a MIME profile, MIME
     requirements should be met.

     SEND RULES


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 26]
     Internet Draft               VPIM V3                August 20, 1999


     Compliant VPIM implementations MAY send the Text/Plain content-type.
     It should be understood that the textual information is not considered
     a primary media within multipart/voice-message and may be discarded by
     a receiving system.

     RECEIVE RULES

     Within a multipart/voice message, the text/plain content type MAY be
     dropped from the message with a suitable advisory presented to the
     recipient.  The originator MAY be notified of a partial message
     delivery by a suitable MDN.

     Outside a Multipart/Voice message, compliant implementations MUST
     accept Text/Plain messages, however, specific handling is left as an
     implementation decision. From [MIME2]

     There are several mechanisms that can be used to support text (once
     accepted) on voice messaging systems including text-to-speech and
     text-to-fax conversions.  If no rendering of the text is possible
     (i.e., it is not possible for the recipient to determine if the text
     is a critical part of the message), the entire message MUST be
     returned to the sender with a negative delivery status notification
     and a media-unsupported status code.

  5.5.4 Text/Informational

     SEND RULES

     The text/informational content type MAY be included as the first
     section of a multipart/voice-message to explain the structure of a
     VPIM Version 3 message, and optionally to instruct the recipient where
     to download a suitable helper application or plug-in.

     RECEPTION RULES

     The display/playing of text/informational content type should be
     suppressed for systems supporting VPIM Version 3 messages.  The text
     is intended for MIME-capable, but non-VPIM capable email clients as an
     advisory.

  5.6 Return and Notification Messages

     VPIM delivery status notification messages (5.6.2) MUST be sent to the
     originator of the message when any form of non-delivery of the subject
     message or its components occurs.  These error messages must be sent
     to the return path (5.2.6) if present, otherwise, the From (5.2.1)
     address may be used.

     VPIM Receipt Notification messages (5.6.3) should be sent to the
     sender specified in the Disposition-Notification-To header field
     (5.2.14).  The MDN should be sent after the message has been presented
     to the recipient or if the message has somehow been disposed of
     without being presented to the recipient (e.g. if it were deleted
     before playing it).

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 27]
     Internet Draft               VPIM V3                August 20, 1999


     VPIM Notification messages may be positive or negative, and can
     indicate delivery at the server or receipt by the client.  However,
     the notification MUST be contained in a multipart/report container
     (5.5.4) and SHOULD contain a spoken error message.

  5.6.1 Multipart/Report

     The Multipart/Report is used for enclosing human-readable and machine
     parsable notification (e.g. Message/delivery-status) body parts and
     any returned message content. The multipart/report content-type is
     used to deliver both delivery status reports indicating transport
     success or failure and message disposition notifications to indicate
     post-delivery events such as receipt notification. Compliant
     implementations MUST use the Multipart/Report construct. Compliant
     implementations MUST recognize and decode the Multipart/Report content
     type and its components in order to present the report to the user.
     From [REPORT]

     Multipart/Report messages from VPIM implementations MAY include the
     human-readable description of the error as a spoken audio/* content
     (this speech MAY be made available to the notification recipient).  As
     well, VPIM implementations MUST be able to handle (and MAY generate)
     Multipart/Report messages that encode the human-readable description
     of the error as text.  Note that per [DSN] the human-readable part
     MUST always be present.

  5.6.2 Message/Delivery-status

     This MIME body part is used for sending machine-parsable delivery
     status notifications.  Compliant implementations MUST use the
     Message/delivery-status construct when returning messages or sending
     warnings.  Compliant implementations MUST recognize and decode the
     Message/delivery-status content type and present the reason for
     failure to the sender of the message.  From [DSN]

  5.6.3 Message/Disposition-notification

     This MIME body part is used for sending machine-parsable read-receipt
     message disposition notifications.  Conforming implementations SHOULD
     use the Message/Disposition-notification construct when sending post-
     delivery message status notifications.  These MDNs, however, MUST only
     be sent in response to the presence of the Disposition-notification-to
     header in 5.2.14.  Conforming implementations should recognize and
     decode the Message/Disposition-notification content type and present
     the notification to the user. From [MDN]

  5.7 Forwarded Messages

     VPIM version 2 explicitly supports the forwarding of voice and fax
     content with voice or fax annotation.  However, only the two
     constructs described below are acceptable in a VPIM message.  Since
     only the first (i.e. message/rfc822) can be recognized as a forwarded
     message (or even multiple forwarded messages), it is RECOMMENDED that
     this construct be used whenever possible.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 28]
     Internet Draft               VPIM V3                August 20, 1999


     Forwarded VPIM messages SHOULD be sent as a multipart/voice-message
     with the entire original message enclosed in a message/rfc822 content
     type and the annotation as a separate Audio/* or image/* body part.
     If the RFC822 header fields are not available for the forwarded
     content, simulated header fields with available information SHOULD be
     constructed to indicate the original sending timestamp, and the
     original sender as indicated in the "From" line.  However, note that
     at least one of "From", "Subject", or "Date" MUST be present.  As
     well, the message/rfc822 content MUST include at least the "MIME-
     Version", and "Content-Type" header fields. From [MIME2]

     In the event that forwarding information is lost through concatenation
     of the original message and the forwarding annotation, such as must be
     done in a gateway between VPIM and the AMIS voice messaging protocol,
     the entire audio content MAY be sent as a single Audio/* segment
     without including any forwarding semantics.

  5.7.1 Message/RFC822

     MIME requires support of the Message/RFC822 message encapsulation body
     part.  This body part is used within a multipart/voice-message to
     forward complete messages (see 5.7) or to reply with original content
     (see 5.7.1). From [MIME2]

     RECEPTION RULES

     May flatten structure if necessary to fit within the message structure
     of the recipients voice mailbox.

  5.8 Reply Messages

     Replies to VPIM messages (and Internet mail messages) are addressed to
     the address noted in the reply-to header (see 5.2.8) if it is present,
     else the From address (see 5.2.1) is used. The vCard EMAIL attribute,
     if present, SHOULD be the same as the reply-to address and may be the
     same as the From address.  It is expected that within legacy email
     implementations, the voice message viewer application may need to
     create a reply message without the benefit of the RFC822 headers.  In
     such a case, the vCard MAY be used to generate a reply to the sender.

     RECEPTION RULES

     Support of multiple originator header fields is often not possible on
     voice messaging systems, so it may be necessary to choose only one
     when gatewaying a VPIM message to another voice message system.
     However, implementers should note that this may make it impossible to
     send error messages and replies to their proper destinations.

     In some cases, a reply message is not possible, such as with a message
     created by telephone answering (i.e. classic voice mail).  In this
     case, the From field MUST contain the special address non-mail-
     user@domain (see 5.1.2).  A null ESMTP MAIL FROM address SHOULD also
     be used in this case (see 6.1.2).  A receiving VPIM system SHOULD NOT
     offer the user the option to reply to this kind of message.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 29]
     Internet Draft               VPIM V3                August 20, 1999


  5.9 Notification Messages

     VPIM delivery status notification messages (5.6.2) MUST be sent to the
     originator of the message when any form of non-delivery of the subject
     message or its components occurs.  These error messages must be sent
     to the return path (5.2.6) if present, otherwise, the From (5.2.1)
     address may be used.

     VPIM Receipt Notification messages (5.6.3) should be sent to the
     sender specified in the Disposition-Notification-To header field
     (5.2.14), only after the message has been presented to the recipient
     or if the message has somehow been disposed of without being presented
     to the recipient (e.g. if it were deleted before playing it).

     VPIM Notification messages may be positive or negative, and can
     indicate delivery at the server or receipt by the client.  However,
     the notification MUST be contained in a multipart/report container
     (5.5.4) and SHOULD contain a spoken error message.

     If a VPIM system receives a message with contents that are not
     understood (see 5.4 & 5.5), its handling is a local matter.  A
     delivery status notification SHOULD be generated if the message could
     not be delivered because of unknown contents (e.g., on traditional
     voice processing systems).  In some cases, the message may be
     delivered (with a positive DSN sent) to a mailbox before the
     determination of rendering can be made.





























     Vaudreuil, Parsons       Expires 8/1/99                   [Page 30]
     Internet Draft               VPIM V3                August 20, 1999


  6. Message Transport Protocol

     Messages are transported between voice mail machines using the
     Internet Extended Simple Mail Transfer Protocol (ESMTP).  All
     information required for proper delivery of the message is included in
     the ESMTP dialog.  This information, including the sender and
     recipient addresses, is commonly referred to as the message
     "envelope".  This information is equivalent to the message control
     block in many analog voice messaging  protocols.

     ESMTP is a general-purpose messaging protocol, designed both to send
     mail and to allow terminal console messaging.  Simple Mail Transport
     Protocol (SMTP) was originally created for the exchange of US-ASCII 7-
     bit text messages.  Binary and 8-bit text messages have traditionally
     been transported by encoding the messages into a 7-bit text-like form.
     [ESMTP] formalized an extension mechanism for SMTP, and subsequent
     RFCs have defined 8-bit text networking, command streaming, binary
     networking, and extensions to permit the declaration of message size
     for the efficient transmission of large messages such as multi-minute
     voice mail.

     The following sections list ESMTP commands, keywords, and parameters
     that are required and those that are optional for conformance to this
     profile.

  6.1 ESMTP Commands

  6.1.1 HELO

     Base SMTP greeting and identification of sender.  This command is not
     to be sent by compliant systems unless the more-capable EHLO command
     is not accepted.  It is included for compatibility with general SMTP
     implementations.  Compliant servers MUST implement the HELO command
     for backward compatibility but clients SHOULD NOT send it unless EHLO
     is not supported.  From [SMTP]

  6.1.2 MAIL FROM (REQUIRED)

     Originating mailbox.  This address contains the mailbox to which
     errors should be sent.  VPIM implementations SHOULD use the same
     address in the MAIL FROM command as is used in the From header field.
     This address is not necessarily the same as the message Sender listed
     in the message header fields if the message was received from a
     gateway or sent to an Internet-style mailing list. From [SMTP, ESMTP]

     The MAIL FROM address SHOULD be stored in the local message store for
     the purposes of generating a delivery status notification to the
     originator. The address indicated in the MAIL FROM command SHOULD be
     passed as a local system parameter or placed in a Return-Path: line
     inserted at the beginning of a VPIM message.  From [HOSTREQ]





     Vaudreuil, Parsons       Expires 8/1/99                   [Page 31]
     Internet Draft               VPIM V3                August 20, 1999


     Since delivery status notifications MUST be sent to the MAIL FROM
     address, the use of the null address ("<>") is often used to prevent
     looping of messages.  This null address MAY be used to note that a
     particular message has no return path (e.g. a telephone answer
     message).  From [SMTP]

  6.1.3 RCPT TO

     Recipient's mailbox. The parameter to this command contains only the
     address to which the message should be delivered for this transaction.
     It is the set of addresses in one or more RCPT TO commands that are
     used for mail routing. From [SMTP, ESMTP]

     Note: In the event that multiple transport connections to multiple
     destination machines are required for the same message, the set of
     addresses in a given transport connection may not match the list of
     recipients in the message header fields.

  6.1.4 DATA

     Initiates the transfer of message data.  Support for this command is
     required.  Compliant implementations MUST implement the SMTP DATA
     command for backwards compatibility.  From [SMTP]

  6.1.5 TURN

     Requests a change-of-roles, that is, the client that opened the
     connection offers to assume the role of server for any mail the remote
     machine may wish to send.  Because SMTP is not an authenticated
     protocol, the TURN command presents an opportunity to improperly fetch
     mail queued for another destination.  Compliant implementations SHOULD
     NOT implement the TURN command.  From [SMTP]

  6.1.6 QUIT

     Requests that the connection be closed.  If accepted, the remote
     machine will reset and close the connection.  Compliant
     implementations MUST implement the QUIT command.  From [SMTP]

  6.1.7 RSET

     Resets the connection to its initial state.  Compliant implementations
     MUST implement the RSET command. From [SMTP]

  6.1.8 VRFY

     Requests verification that this node can reach the listed recipient.
     While this functionality is also included in the RCPT TO command, VRFY
     allows the query without beginning a mail transfer transaction.  This
     command is useful for debugging and tracing problems.  Compliant
     implementations MAY implement the VRFY command.  From [SMTP]




     Vaudreuil, Parsons       Expires 8/1/99                   [Page 32]
     Internet Draft               VPIM V3                August 20, 1999


     (Note that the implementation of VRFY may simplify the guessing of a
     recipient's mailbox or automated sweeps for valid mailbox addresses,
     resulting in a possible reduction in privacy.  Various implementation
     techniques may be used to reduce the threat, such as limiting the
     number of queries per session.)  From [SMTP]

  6.1.9 EHLO

     The enhanced mail greeting that enables a server to announce support
     for extended messaging options.  The extended messaging modes are
     discussed in subsequent sections of this document.  Compliant
     implementations MUST implement the ESMTP command and return the
     capabilities indicated later in this memo.  From [ESMTP]

  6.1.10 BDAT

     The BDAT command provides a higher efficiency alternative to the
     earlier DATA command, especially for voice. The BDAT command provides
     for native binary transport of messages. Compliant implementations
     SHOULD support binary transport using the BDAT command.[BINARY]

  6.2 ESMTP Keywords

     The following ESMTP keywords indicate extended features useful for
     voice messaging.

  6.2.1 PIPELINING

     The "PIPELINING" keyword indicates ability of the receiving server to
     accept new commands before issuing a response to the previous command.
     Pipelining commands dramatically improves performance by reducing the
     number of round-trip packet exchanges and makes it possible to
     validate all recipient addresses in one operation.  Compliant
     implementations SHOULD support the command pipelining indicated by
     this keyword.  From [PIPE]

  6.2.2 SIZE

     The "SIZE" keyword provides a mechanism by which the SMTP server can
     indicate the maximum size message supported.  Compliant servers MUST
     provide size extension to indicate the maximum size message that can
     be accepted.  Clients SHOULD NOT send messages larger than the size
     indicated by the server.  Clients SHOULD advertise SIZE= when sending
     messages to servers that indicate support for the SIZE extension. From
     [SIZE]

  6.2.3 CHUNKING

     The "CHUNKING" keyword indicates that the receiver will support the
     high-performance binary transport mode.  Note that CHUNKING can be
     used with any message format and does not imply support for binary
     encoded messages. Compliant implementations MAY support binary
     transport indicated by this capability.  From [BINARY]


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 33]
     Internet Draft               VPIM V3                August 20, 1999


  6.2.4 BINARYMIME

     The "BINARYMIME" keyword indicates that the SMTP server can accept
     binary encoded MIME messages. Compliant implementations MAY support
     binary transport indicated by this capability.  Note that support for
     this feature requires support of CHUNKING.  From [BINARY]

  6.2.5 DSN

     The "DSN" keyword indicates that the SMTP server will accept explicit
     delivery status notification requests.  Compliant implementations MUST
     support the delivery notification extensions in [DRPT].

  6.2.6 ENHANCEDSTATUSCODES

     The "ENHANCEDSTATUSCODES" keyword indicates that an SMTP server
     augments its responses with the enhanced mail system status codes
     [CODES].  These codes can then be used to provide more informative
     explanations of error conditions, especially in the context of the
     delivery status notification format defined in [DSN]. Compliant
     implementations SHOULD support this capability.  From [STATUS]

  6.3 ESMTP Parameters - MAIL FROM

  6.3.1 BINARYMIME

     The current message is a binary encoded MIME messages.  Compliant
     implementations SHOULD support binary transport indicated by this
     parameter.  From [BINARY]

  6.3.2 RET

     The RET parameter indicates whether the content of the message should
     be returned.  Compliant systems SHOULD honor a request for returned
     content. From [DRPT]

  6.3.3 ENVID

     The ENVID keyword of the SMTP MAIL command is used to specify an
     "envelope identifier" to be transmitted along with the message and
     included in any DSNs issued for any of the recipients named in this
     SMTP transaction.  The purpose of the envelope identifier is to allow
     the sender of a message to identify the transaction for which the DSN
     was issued. Compliant implementations MAY use this parameter.  From
     [DRPT]

     Should use the original email address of the sender in this field.
     This is less an envelope ID and more of a billing ID.







     Vaudreuil, Parsons       Expires 8/1/99                   [Page 34]
     Internet Draft               VPIM V3                August 20, 1999


  6.4 ESMTP Parameters - RCPT TO

  6.4.1 NOTIFY

     The NOTIFY parameter indicates the conditions under which a delivery
     report should be sent. Compliant implementations MUST honor this
     request.  From [DRPT]

  6.4.2 ORCPT

     The ORCPT keyword of the RCPT command is used to specify an "original"
     recipient address that corresponds to the actual recipient to which
     the message is to be delivered.  If the ORCPT esmtp-keyword is used,
     it MUST have an associated esmtp-value, which consists of the original
     recipient address, encoded according to the rules below. Compliant
     implementations MAY use this parameter.  From [DRPT]

  6.5 ESMTP - SMTP Downgrading

     The ESMTP extensions suggested or required for conformance to VPIM
     fall into two categories.  The first category includes features which
     increase the efficiency of the transport system such as SIZE,
     BINARYMIME, and PIPELINING.  In the event of a downgrade to a less
     functional transport system, these features can be dropped with no
     functional change to the sender or recipient.

     The second category of features is transport extensions in support of
     new functions.  DSN and EnhancedStatusCodes provide essential
     improvements in the handling of delivery status notifications to bring
     email to the level of reliability expected of Voice Mail.  To ensure a
     consistent level of service across an intranet or the global Internet,
     it is essential that VPIM compliant ESMTP support the ESMTP DSN
     extension at all hops between a VPIM originating system and the
     recipient system. In the situation where a `downgrade' is unavoidable
     a relay hop may be forced (by the next hop) to forward a VPIM message
     without the ESMTP request for positive delivery status notification.
     It is RECOMMENDED that the downgrading system should continue to
     attempt to deliver the message, but MUST send an appropriate delivery
     notification to the originator, e.g. the message left an ESMTP host
     and was sent (unreliably) via SMTP.

  7. Conformance Requirements

     <To be completed>

  8. Security Considerations

  8.1 General Directive

     This document is a profile of existing Internet mail protocols.  To
     maintain interoperability with Internet mail, any security to be
     provided should be part of the Internet security infrastructure,
     rather than a new mechanism or some other mechanism outside of the
     Internet infrastructure.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 35]
     Internet Draft               VPIM V3                August 20, 1999


  8.2 Threats and Problems

     Both Internet mail and voice messaging have their own set of threats
     and countermeasures.  As such, this specification does not create any
     security issues not already existing in the profiled Internet mail and
     voice mail protocols themselves.  This section attends only to the set
     of additional threats that ensue from integrating the two services.

  8.2.1 Spoofed sender

     The actual sender of the voice message might not be the same as that
     specified in the Sender or From header fields of the message content
     header fields or the MAIL FROM address from the SMTP envelope.  In a
     tightly constrained environment, sufficient physical and software
     controls may be able to ensure prevention of this problem.  In
     addition, the recognition of the sender's voice may provide confidence
     of the sender's identity irrespective of that specified in Sender or
     From.  It should be recognized that SMTP implementations do not
     provide inherent authentication of the senders of messages, nor are
     sites under obligation to provide such authentication.

  8.2.2 Unsolicited voice mail

     Assigning an Internet mail address to a voice mailbox opens the
     possibility of receiving unsolicited messages (either text or voice
     mail).  Traditionally voice mail systems operated in closed
     environments and were not susceptible to unknown senders.  Voice mail
     users have a higher expectation of mailbox privacy and may consider
     such messages as a security breach.  Many Internet mail systems are
     choosing to block all messages from unknown sources in an attempt to
     curb this problem.

  8.2.3 Message disclosure

     Users of voice messaging systems have an expectation of a level of
     message privacy that is higher than the level provided by Internet
     mail without security enhancements.  This expectation of privacy by
     users SHOULD be preserved as much as possible.

  8.3 Security Techniques

     Sufficient physical and software control may be acceptable in
     constrained environments.  Further, the profile specified in this
     document does not in any way preclude the use of any Internet object
     or channel security protocol to encrypt, authenticate, or non-
     repudiate the messages.









     Vaudreuil, Parsons       Expires 8/1/99                   [Page 36]
     Internet Draft               VPIM V3                August 20, 1999


     References

  [8BIT] Klensin, J., Freed, N., Rose, M., Stefferud, E., D. Crocker,
      "SMTP Service Extension for 8bit-MIMEtransport" RFC 1426, United
      Nations University, Innosoft International, Inc., Dover Beach
      Consulting, Inc., Network Management Associates, Inc., The Branch
      Office, February 1993.

  [ADPCM] G. Vaudreuil and G. Parsons, "Toll Quality Voice - 32 kbit/s
      ADPCM:  MIME Sub-type Registration", Work In Progress, <draft-ema-
      vpim-32kadpcm-02.txt>, November 1997.

  [AMIS-A] Audio Messaging Interchange Specifications (AMIS) - Analog
       Protocol Version 1, Issue 2, February 1992.

  [AMIS-D] Audio Messaging Interchange Specifications (AMIS) - Digital
      Protocol Version 1, Issue 3 August 1993.

  [BINARY] Vaudreuil, G., "SMTP Service Extensions for Transmission of
      Large and Binary MIME Messages", RFC 1830, October 1995.

  [CODES] Vaudreuil, G. "Enhanced Mail System Status Codes", RFC 1893,
      01/15/1996.

  [MIMEDIR] F. Dawson, T. Howes, & M. Smith, "A MIME Content-Type for
      Directory Information", Work In Progress, <draft-ietf-asid-mime-
      direct-06.txt>, March 1998

  [DISP] R. Troost and S. Dorner, Communicating Presentation Information
      in Internet Messages:  The Content-Disposition Header, RFC 2183,
      August 1997

  [DNS1] Mockapetris, P., "Domain names - implementation and
      specification", RFC1035, Nov 1987.

  [DNS2] Mockapetris, P., "Domain names - concepts and facilities", RFC
      1034, Nov 1987.

  [DRPT] Moore, K. "SMTP Service Extensions for Delivery Status
      Notifications", RFC 1891, 01/15/1996

  [DSN] Moore, K., Vaudreuil, G., "An Extensible Message Format for
      Delivery Status Notifications", RFC 1894, 01/15/1996.

  [DUR] G. Parsons and G. Vaudreuil, "Content Duration MIME Header
      Definition", Work In Progress, <draft-ema-vpim-dur-02.txt>, November
      1997.

  [E164] CCITT Recommendation E.164 (1991), Telephone Network and ISDN
      Operation, Numbering, Routing and  Mobile Service - Numbering Plan
      for the ISDN Era.




     Vaudreuil, Parsons       Expires 8/1/99                   [Page 37]
     Internet Draft               VPIM V3                August 20, 1999


  [ESMTP] Klensin, J., Freed, N., Rose, M., Stefferud, E., and D. Crocker,
      "SMTP Service Extensions" RFC 1869, United Nations University,
      Innosoft International, Inc., Dover Beach Consulting, Inc., Network
      Management Associates, Inc., The Branch Office, November 1995.

  [G726] CCITT Recommendation G.726 (1990), General Aspects of Digital
      Transmission Systems, Terminal Equipment - 40, 32, 24,16 kbit/s
      Adaptive Differential Pulse Code Modulation (ADPCM).

  [HOSTREQ] Braden, R., "Requirements for Internet Hosts -- Application
      and Support", STD 3, RFC 1123, October 1989.

  [LANG] Alvestrand,H., "Tags for the Identification of Languages", RFC
      1766, Mar 1995

  [MDN] Fajman, Roger, "An Extensible Message Format for Message
      Disposition Notifications" Work In Progress, <draft-ietf-receipt-mdn-
      08.txt>, January 1998

  [MIB II] M. Rose, "Management Information Base for Network Management of
      TCP/IP-based internets:  MIB-II", RFC 1158, May 1990.

  [MIME1] N. Freed and N. Borenstein,  "Multipurpose Internet Mail
      Extensions (MIME) Part One: Format of Internet Message Bodies", RFC
      2045, Innosoft, First Virtual, Nov 1996.

  [MIME2] N. Freed and N. Borenstein,  "Multipurpose Internet Mail
      Extensions (MIME) Part Two: Media Types ", RFC 2046, Innosoft, First
      Virtual, Nov 1996.

  [MIME3] K. Moore,  "Multipurpose Internet Mail Extensions (MIME) Part
      Three: Message Header Extensions for Non-ASCII Text ", RFC 2047,
      University of Tennessee, Nov 1996.

  [MIME4] N. Freed, J. Klensin and J. Postel,  "Multipurpose Internet Mail
      Extensions (MIME) Part Four: Registration Procedures", RFC 2048,
      Innosoft, MCI, ISI, Nov 1996.

  [MIME5] N. Freed and N. Borenstein,  "Multipurpose Internet Mail
      Extensions (MIME) Part Five: Conformance Criteria and Examples ", RFC
      2049, Innosoft, First Virtual, Nov 1996.

  [PIPE] Freed, N., Cargille, A., "SMTP Service Extension for Command
      Pipelining" RFC 1854, October 1995.

  [REPORT] Vaudreuil, G., "The Multipart/Report Content Type for the
      Reporting of Mail System Administrative Messages", RFC 1892,
      01/15/1996.

  [REQ] S. Bradner, "Key words for use in RFCs to Indicate Requirement
      Levels", RFC 2119, March 1997.

  [RFC822] Crocker, D., "Standard for the Format of ARPA Internet Text
      Messages", STD 11, RFC 822, UDEL, August 1982.

     Vaudreuil, Parsons       Expires 8/1/99                   [Page 38]
     Internet Draft               VPIM V3                August 20, 1999


  [SIZE] Klensin, J, Freed, N., Moore, K, "SMTP Service Extensions for
      Message Size Declaration" RFC 1870,  United Nations University,
      Innosoft International, Inc., November 1995.

  [SMTP] Postel, J., "Simple Mail Transfer Protocol", STD 10, RFC 821,
      USC/Information Sciences Institute, August 1982.

  [STATUS] Freed, N. "SMTP Service Extension for Returning Enhanced Error
      Codes", RFC 2034, 10/30/1996.

  [TIFF-F] G. Parsons and J. Rafferty, "Tag Image File Format:
      Application F", <draft-ietf-fax-tiff-09.txt>, February 1998.

  [TIFFREG] G. Parsons, J. Rafferty & S. Zilles, "Tag Image File Format:
      image/tiff - MIME sub-type registraion", RFC????, ??? 1998.

  [V-MSG] G. Vaudreuil and G. Parsons, "VPIM Voice Message:  MIME Sub-type
      Registration", RFC 2022, September 1998.

  [VCARD] Dawson, Frank, Howes, Tim, "vCard MIME Directory Profile"
      RFC????, September 1998.

  [VPIM1] Vaudreuil, Greg, "Voice Profile for Internet Mail", RFC 1911,
      Feb 1996.

  [VPIM2] Vaudreuil, Greg, Parsons, Glen, "Voice Profile for Internet
      Mail, Version 2", RFC 2421, September 1998.

  [X.400] Hardcastle-Kille, S., "Mapping between X.400(1988) / ISO 10021
      and RFC 822", RFC 1327, May 1992.

  9. Acknowledgments

     The author's would like to offer a special thanks to the Lucent
     Internal design team consisting of Gordon Brunsen, Ralph Costantini,
     Cliff Didcock, Greg Vaudreuil and Michael Wilson from whom the
     outlines of the VPIM V3 proposal originated.

     The author's would like to recognise the EMA voice messaging
     committee, especially Kevin Chestnut, Bernhard Elliot, and Holly
     Gabrowski who provided critical review and initial support to get this
     project rolling.

     The EMA hosts the VPIM web page at http://www.ema.org/vpim.











     Vaudreuil, Parsons       Expires 8/1/99                   [Page 39]
     Internet Draft               VPIM V3                August 20, 1999


  10. Copyright Notice

     "Copyright (C) The Internet Society (1998). All Rights Reserved.

     This document and translations of it may be copied and furnished to
     others, and derivative works that comment on or otherwise explain it
     or assist in its implementation may be prepared, copied, published and
     distributed, in whole or in part, without restriction of any kind,
     provided that the above copyright notice and this paragraph are
     included on all such copies and derivative works.  However, this
     document itself may not be modified in any way, such as by removing
     the copyright notice or references to the Internet Society or other
     Internet organizations, except as needed for the  purpose of
     developing Internet standards in which case the procedures for
     copyrights defined in the Internet Standards process must be followed,
     or as required to translate it into languages other than English.

     The limited permissions granted above are perpetual and will not be
     revoked by the Internet Society or its successors or assigns.

     This document and the information contained herein is provided on an
     "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
     TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT
     NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN
     WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
     MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE."



  11. Authors' Addresses

     Glenn W. Parsons
     Nortel Networks
     P.O. Box 3511, Station C
     Ottawa, ON  K1Y 4H7
     Canada

     Phone: +1-613-763-7582
     Fax: +1-613-763-4461
     EMail: GParsons@NortelNetworks.com

     Gregory M. Vaudreuil
     Lucent Technologies,
        Octel Messaging Division
     17080 Dallas Parkway
     Dallas, TX  75248-1905
     United States

     Phone/Fax: +1-972-733-2722
     Email: GregV@Lucent.Com





     Vaudreuil, Parsons       Expires 8/1/99                   [Page 40]
     Internet Draft               VPIM V3                August 20, 1999


  12. Appendix A - VPIM Requirements Summary

     <to be created>




















































     Vaudreuil, Parsons       Expires 8/1/99                   [Page 41]
     Internet Draft               VPIM V3                August 20, 1999


  13. Appendix B - Example Voice Messages

     The following is a full-featured VPIM V3 message designed by the
     sending system to be as broadly compatable with desktop email clients
     as possible.  This message includes a message attributes of urgent,
     private, and read-receipt request.

     VPIM Message:
          To: +19725551212@mycompany.com
          To: +16135551234@mycompany.com
          From: "Parsons, Glenn" <+12145551234@mycompany.com>
          Date: Mon, 26 Aug 93 10:20:20 -0700 (CDT)
          MIME-Version: 1.0  (Voice 3.0)
          Content-type: Multipart/Voice-Message; Version=3.0;
            Boundary="MessageBoundary"
          Content-Transfer-Encoding: 7bit
          Message-ID: 123456789@VM2.mycompany.com
          Disposition-Notification-To: <+12145551234@mycompany.com>
          Sensitivity: Private
          Importance: High

          --MessageBoundary
          Content-type: Audio/WAV; codec=49
          Content-Transfer-Encoding: Base64
          Content-Disposition: inline; voice=Voice-Message
          Content-Language: en-US
          Content-ID: part1@VM2-4321

          glslfdslsertiflkTfpgkTportrpkTpfgTpoiTpdadasssdasddasdasd
          (This is a sample of the base-64 Spoken Message data)
          fgdhgddlkgpokpeowrit09==

          --MessageBoundary
          Content-type: text/directory; charset=us-ascii; profile=vCard
          Content-Transfer-Encoding: 7bit

          BEGIN:VCARD
          N:Parsons;Glenn;;Mr.;
          EMAIL;TYPE=INTERNET:+12145551234@mycompany.com
          TEL:+1-214-555-1234
          SOUND;TYPE=32KADPCM;ENCODING=B;
             kdsfkaskflkkasdf
             - Base-64 spoken name content -
             sdfsdfsdfsdfsfsfsdf=
          REV:19951031T222710Z
          VERSION: 3.0
          END:VCARD

          --MessageBoundary-






     Vaudreuil, Parsons       Expires 8/1/99                   [Page 42]
     Internet Draft               VPIM V3                August 20, 1999


     The following is a simple VPIM V3 message including a PowerPoint
     attachment destined to another voice messaging server on a local high-
     bandwidth Intranet.  The example uses the mu-law voice encoding since
     there is little need to expend the CPU to encode the message in a
     smaller form.

     VPIM Message:
          To: +19725551212@mycompany.com
          To: +16135551234@mycompany.com
          From: "Parsons, Glenn" <+12145551234@mycompany.com>
          Date: Mon, 26 Aug 93 10:20:20 -0700 (CDT)
          MIME-Version: 1.0  (Voice 3.0)
          Content-type: Multipart/Voice-Message; Version=3.0;
             Boundary="MessageBoundary"
          Content-Transfer-Encoding: 7bit
          Message-ID: 123456789@VM2.mycompany.com

          --MessageBoundary
          Content-type: Audio/BASIC
          Content-Transfer-Encoding: Base64
          Content-Disposition: inline; voice=Voice-Message
          Content-Language: en-US
          Content-ID: part1@VM2-4321

          glslfdslsertiflkTfpgkTportrpkTpfgTpoiTpdadasssdasddasdasd
          (This is a sample of the base-64 Spoken Message data)
          fgdhgddlkgpokpeowrit09==

          --MessageBoundary
          Content-type: Application/Octet-Stream; filename=howdy.ppt
          Content-Transfer-Encoding: Base=64

          glslfdslsertiflkTfpgkTportrpkTpfgTpoiTpdadasssdasddasdasd
          (This is a sample of the base-64 encoded PowerPoint Presentation
          fgdhgddlkgpokpeowrit09==

          --MessageBoundary
          Content-type: text/directory; charset=us-ascii; profile=vCard
          Content-Transfer-Encoding: 7bit

          BEGIN:VCARD
          N:Parsons;Glenn;;Mr.;
          EMAIL;TYPE=INTERNET:+12145551234@mycompany.com
          TEL:+1-217-555-1234
          SOUND;TYPE=32KADPCM;ENCODING=B;
             kdsfkaskflkkasdf
             - Base-64 spoken name content -
             sdfsdfsdfsdfsfsfsdf=
          REV:19951031T222710Z
          VERSION: 3.0
          END:VCARD

          --MessageBoundary-


     Vaudreuil, Parsons       Expires 8/1/99                   [Page 43]
     Internet Draft               VPIM V3                August 20, 1999


     If the receiving voice mail machine cannot store a PowerPoint
     presentation, it may discard the attachment and provide notification
     to the recipient that there was an attachment that could not be
     delivered.



















































     Vaudreuil, Parsons       Expires 8/1/99                   [Page 44]
     Internet Draft               VPIM V3                August 20, 1999


  14. Appendix C - Example Error Voice Processing Error Codes

     The following common voice processing errors and their corresponding
     status codes are given as examples.  Text after the error codes are
     intended only for reference to describe the error code.
     Implementations should provide implementation specific informative
     comments after the error code rather than the text below.

         Error condition                 RFC 1893 Error codes
         -----------------------------   --------------------------------

         Analog delivery failed          4.4.0 Persistent connection error
         because remote system is busy         - other

         Analog delivery failed          4.4.1 Persistent protocol error
         because remote system is              - no answer from host
         ring-no-answer

         Remote system did not answer    5.5.5 Permanent protocol error
         AMIS-Analog handshake ("D" in         - wrong version
         response to "C" at connect
         time)

         Mailbox does not exist          5.1.1 Permanent mailbox error
                                               - does not exist

         Mailbox full or over quota      4.2.2 Persistent mailbox error
                                               - full

         Disk full                       4.3.1 Persistent system error
                                               - full

         Command out of sequence         5.5.1 Permanent protocol error
                                               - invalid command

         Frame Error                     5.5.2 Permanent protocol error
                                               - syntax error

         Mailbox does not support FAX    5.6.1 Permanent media error
                                               - not supported

         Mailbox does not support TEXT   5.6.1 Permanent media error
                                               - not supported

         Sender is not authorized        5.7.1 Permanent security error
                                               - sender not authorized

         Message marked private, but     5.3.3 Permanent system error
         system is not private capable         - not feature capable

         Destination does not support    5.5.0 Permanent protocol error
         Version 3, not delivered



     Vaudreuil, Parsons       Expires 8/1/99                   [Page 45]
     Internet Draft               VPIM V3                August 20, 1999


  15. Appendix D - Example Voice Processing Disposition Types

     The following common voice processing disposition conditions and their
     corresponding MDN Disposition (which contains the disposition mode,
     type and modifier, if applicable) are given as examples. Implementers
     should refer to [MDN] for a full description of the format of message
     disposition notifications.

     Notification event               MDN Disposition mode, type & modifier
     ------------------------------   -------------------------------------

     Message played by recipient,    manual-action/MDN-sent-automatically;
     receipt automatically returned  displayed

     Message deleted from mailbox    manual-action/MDN-sent-automatically;
     by user without listening       deleted

     Message cleared when mailbox    manual-action/MDN-sent-automatically;
     deleted by admin                deleted/mailbox-terminated

     Message automatically deleted   automatic-action/
     when older than administrator   MDN-sent-automatically; deleted/
     set threshold                   expired

     Message processed, however      manual-action/MDN-sent-automatically;
     audio encoding unknown -        processed/error
     unable to play to user          Error: unknown audio encoding




























     Vaudreuil, Parsons       Expires 8/1/99                   [Page 46]
     Internet Draft               VPIM V3                August 20, 1999


  16. Appendix F - Change History: RFC 2421 (VPIM V2) to this Document

     The updated profile in this document is based on the Lucent experience
     planning implementations for the diverse portfolio of voice messaging
     and unified messaging products. This version of the profile is
     significantly different from the previous described in [VPIM2].  The
     changes are categorized as general, content, transport and compliance.
     They are detailed below:

     1. General

          - a refined multipart/voice-message definition

          - Addition of three new must-receive audio encodings.  These are
          GSM, G.723.1, and mu-law.

       - Changed the Voice version to Version 3



       - Various editorial updates to improve readability.  Separated send
       rules from reception rules.

       - Clarified the behavior upon reception of unrecognized content
       types expected with the interworking between voice and unified
       messaging systems.

     2. Content

       -  Changed handling of received lines by a gateway to SHOULD NOT
          delete in a gateway.  In gateways to systems such as AMIS, it is
          not possible to preserve this information.  It is intended that
          such systems be able to claim conformance.

       -  Changed the encoding of spoken name in vCards from "by-reference"
          to "inline".

     3. Transport

       -

     4. Compliance













     Vaudreuil, Parsons       Expires 8/1/99                   [Page 47]
